Repository: hkoueke/optimize-bot
Catalog: Properties/Resources.*.resx
Languages: fr

# About
source: {0}{1}{1}Automated assistant programmed in C# .Net 5. The authors decline any responsibility resulting from the use of this automaton and give no guarantee as to the availability of the service and the functionalities. To write to the developers: {2}.
fr: {0}{1}{1}Assistant automatisé programmé en C# .Net 5 sous licence GNU General Public License v3.0 (https://www.gnu.org/licenses/gpl-3.0.html). Pour écrire aux développeurs: {2}.

# BackButtonText
source: Back to {0}
fr: Retour vers {0}

# ErrorNotDownloaded
source: {0} Search failed{1}{1}We couldn't find the document you were looking for. Make sure you enter the correct provider and the correct transaction number, then try again.
fr: {0} Echec de la recherche{1}{1}Nous n'avons pas trouvé le document que vous recherchiez. Assurez-vous d'indiquer le bon prestataire, ainsi que le bon numéro de transaction, puis réessayez.

# Home
source: {0} Home menu
fr: {0} Menu principal

source: No
fr: Non

source: Retry?
fr: Souhaitez-vous réessayer?

# RetryAmount
source: {0} New amount
fr: {0} Nouveau montant

# RetryProvider
source: {0} New provider
fr: {0} Nouveau fournisseur

# ServiceCashIn
source: cash-in
fr: dépôt

# ServiceCashInOutEnterAmount
source: <b>{0}</b>{1}{1}Please enter the amount for which you would like to make a {2}:
fr: <b>{0}</b>{1}{1}Veuillez saisir le montant pour lequel vous souhaitez faire un {2} d'espèces:

# ServiceCashInOutResult
source: A {0} of {1} FCFA through {2} wil cost you CFAF {3} in transaction fees.
fr: Un {0} de {1} FCFA via {2} vous coûtera {3} FCFA en frais de transaction.

# ServiceCashOut
source: cash-out
fr: retrait

# ServiceReceiptEnterTransactionId
source: <b>{0}</b>{1}{1}Please enter the <b>transaction ID</b> as it appears in the message received from {2} :
fr: <b>{0}</b>{1}{1}Veuillez saisir <b>l'identifiant de la transaction</b> telle qu'il apparaît dans le message reçu de {2} :

# ServiceReceiptPleaseWait
source: <b>{0} Searching...</b>{1}{1}We are looking for information on your receipt. You will receive a notification when the search is complete.
fr: <b>{0} Recherche en cours...</b>{1}{1}Nous cherchons des informations sur votre reçu. Vous recevrez une notification une fois la recherche achevée.

# ServiceSelectProvider
source: <b>{0}</b>{1}{1}We have {2} providers offering this service. Please select one of your choice or enter /start to cancel.
fr: <b>{0}</b>{1}{1}Nous avons {2} fournisseurs proposant ce service. Veuillez en sélectionner un, au choix, ou saisir /start pour annuler.

# ServiceSingleProvider
source: <b>{0}</b>{1}{1}Provider <b>{2}</b> is the only one available at the moment. Continue?
fr: <b>{0}</b>{1}{1}Le fournisseur <b>{2}</b> est le seul disponible pour le moment. Continuer?

# WarningAmountOverflow
source: {0} Warning!{1}{1}The entered amount [{2}] is incorrect. Please enter an amount between CFAF {3} and CFAF{4}.
fr: {0} Attention!{1}{1}Le montant saisi [{2}] est incorrect. Veuillez saisir un montant compris entre {3} FCFA et {4} FCFA.

# WarningInvalidAmountFormat
source: {0} Warning!{1}{1}The amount entered is not in the required format. Make sure you only enter numbers.
fr: {0} Attention!{1}{1}Le montant saisi n'est pas au format requis. Assurez-vous de ne saisir que des chiffres.

# WarningInvalidTrxId
source: {0} Warning!{1}{1}The transaction number is incomplete. It should be {2} characters long. Please try again.
fr: {0} Attention!{1}{1}Le numéro de transaction est incomplet. Il devrait comporter {2} caractères. Bien vouloir réessayer.

# WelcomeUserSelectService
source: <b>{0}</b>{1}{1}Welcome, {2}. Please select a service of your choice.
fr: <b>{0}</b>{1}{1}Bienvenue, {2}. Veuillez sélectionner un service, au choix, pour commencer.

source: Yes
fr: Oui
